#### `terraform plan` Success
<details><summary>Show Output</summary>

```
0msource_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # azurerm_network_security_rule.vm2http will be destroyed
  - resource "azurerm_network_security_rule" "vm2http" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "52.169.156.213" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "80" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkSecurityGroups/team1-nsg/securityRules/Port_Internal_80" -> null
      - name                                       = "Port_Internal_80" -> null
      - network_security_group_name                = "team1-nsg" -> null
      - priority                                   = 320 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "devops-training-team1" -> null
      - source_address_prefix                      = "52.169.152.212" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "*" -> null
      - source_port_ranges                         = [] -> null
    }

  # azurerm_network_security_rule.vm3psql will be destroyed
  - resource "azurerm_network_security_rule" "vm3psql" {
      - access                                     = "Allow" -> null
      - destination_address_prefix                 = "52.169.156.208" -> null
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_range                     = "5432" -> null
      - destination_port_ranges                    = [] -> null
      - direction                                  = "Inbound" -> null
      - id                                         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkSecurityGroups/team1-nsg/securityRules/Port_Internal_5432" -> null
      - name                                       = "Port_Internal_5432" -> null
      - network_security_group_name                = "team1-nsg" -> null
      - priority                                   = 310 -> null
      - protocol                                   = "Tcp" -> null
      - resource_group_name                        = "devops-training-team1" -> null
      - source_address_prefix                      = "52.169.156.213" -> null
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_range                          = "5432" -> null
      - source_port_ranges                         = [] -> null
    }

  # azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method            = "Static"
      + fqdn                         = (known after apply)
      + id                           = (known after apply)
      + idle_timeout_in_minutes      = 4
      + ip_address                   = (known after apply)
      + ip_version                   = "IPv4"
      + location                     = "northeurope"
      + name                         = "lbpip"
      + public_ip_address_allocation = (known after apply)
      + resource_group_name          = "devops-training-team1"
      + sku                          = "Basic"
      + tags                         = (known after apply)
    }

  # azurerm_subnet.backend will be created
  + resource "azurerm_subnet" "backend" {
      + address_prefix                                 = "10.0.2.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "backend"
      + network_security_group_id                      = (known after apply)
      + resource_group_name                            = "devops-training-team1"
      + virtual_network_name                           = "acctvnet"
    }

  # azurerm_subnet.database will be created
  + resource "azurerm_subnet" "database" {
      + address_prefix                                 = "10.0.3.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "database"
      + network_security_group_id                      = (known after apply)
      + resource_group_name                            = "devops-training-team1"
      + virtual_network_name                           = "acctvnet"
    }

  # azurerm_subnet.frontend will be created
  + resource "azurerm_subnet" "frontend" {
      + address_prefix                                 = "10.0.1.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "frontend"
      + network_security_group_id                      = (known after apply)
      + resource_group_name                            = "devops-training-team1"
      + virtual_network_name                           = "acctvnet"
    }

  # azurerm_subnet.internal will be destroyed
  - resource "azurerm_subnet" "internal" {
      - address_prefix                                 = "10.0.1.0/24" -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-network/subnets/team1-internal" -> null
      - ip_configurations                              = [
          - "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team11-vm-nic/ipConfigurations/testconfiguration1",
          - "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team12-vm-nic/ipConfigurations/testconfiguration1",
          - "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team13-vm-nic/ipConfigurations/testconfiguration1",
        ] -> null
      - name                                           = "team1-internal" -> null
      - resource_group_name                            = "devops-training-team1" -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "team1-network" -> null
    }

  # azurerm_virtual_machine_scale_set.dbscaleset will be created
  + resource "azurerm_virtual_machine_scale_set" "dbscaleset" {
      + automatic_os_upgrade   = false
      + id                     = (known after apply)
      + license_type           = (known after apply)
      + location               = "northeurope"
      + name                   = "dbscaleset"
      + overprovision          = true
      + resource_group_name    = "devops-training-team1"
      + single_placement_group = true
      + tags                   = (known after apply)
      + upgrade_policy_mode    = "Manual"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + network_profile {
          + ip_forwarding = false
          + name          = "dbNetworkProfile"
          + primary       = true

          + ip_configuration {
              + application_gateway_backend_address_pool_ids = []
              + application_security_group_ids               = []
              + load_balancer_backend_address_pool_ids       = (known after apply)
              + load_balancer_inbound_nat_rules_ids          = (known after apply)
              + name                                         = "DBIPConfiguration"
              + primary                                      = true
              + subnet_id                                    = (known after apply)
            }
        }

      + os_profile {
          + admin_password       = (sensitive value)
          + admin_username       = "testadmin"
          + computer_name_prefix = "team1"
        }

      + os_profile_linux_config {
          + disable_password_authentication = false

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDDOphCHThzsgraK4np2AtNZiQeru2l1gNMyqeSg9K/elaW7kWGqtcsRR3vP1zQDZbWfhhfyqARn9DEZLQFhsAt59CCc1sokmFnWUaHcANS4+3B0fbIFuBJ/i7SgKjkFRXpFoQ7NFzp9uzJ4QQ/R1+qSO80VSPYLz7sciypLphTNXScd3L/gqEBN72Rmbf5Xq5pa1HU4AzEnYd8lc/y9TlCeSs62LoXz+FzRPd8+CzIKtY/T6FAS1fh/E+haVkb8ghkBQ4NIbh7WXCgIUPu/PeM/XTQZ+N6WWI0kuSWdszYzIcVEuflWAwxg8+YXwHn0zX45uF+jRTQX2uy49DH4epeFYbHPQ8ESF/wUdd+M7ZBJQKd/FcVw/otxhK0e7B81TDgVx/Up0I+mgRCHQ45tTcHQ1aSZuLjLov5A6D7EIKdChGSxuWZI6CgQYZt39scOnZbNU0i2Qu2oNOQ8vSCABJ3jTFJUfaF0RN3eICRnwuBogXrpeBYxQm2nP1E9zkjyeSN6uaDPPNJAhztOvz2eHbMRAZjmNvy3EHs2LIntcy3hTgzBM0AzDrtnEwAPkVngPhpB1kX6kJlFZ/Qs+9X9lhQbH32rMB7NOUlJirIvoBTgA/R4LzPR5djI1+S7b1YPLBtqOhgmG9lZcbM4OwjV1mRPRtUuxYS5sWX2RESU156XQ== Generated by E217974@PC38695."
              + path     = "/home/testadmin/.ssh/authorized_keys"
            }
        }

      + sku {
          + capacity = 3
          + name     = "Standard_B1ms"
          + tier     = "Standard"
        }

      + storage_profile_data_disk {
          + caching           = "ReadWrite"
          + create_option     = "Empty"
          + disk_size_gb      = 10
          + lun               = 0
          + managed_disk_type = (known after apply)
        }

      + storage_profile_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_profile_os_disk {
          + caching           = "ReadWrite"
          + create_option     = "FromImage"
          + managed_disk_type = "Standard_LRS"
          + vhd_containers    = []
        }
    }

  # azurerm_virtual_machine_scale_set.privatescaleset will be created
  + resource "azurerm_virtual_machine_scale_set" "privatescaleset" {
      + automatic_os_upgrade   = false
      + id                     = (known after apply)
      + license_type           = (known after apply)
      + location               = "northeurope"
      + name                   = "privatescaleset"
      + overprovision          = true
      + resource_group_name    = "devops-training-team1"
      + single_placement_group = true
      + tags                   = (known after apply)
      + upgrade_policy_mode    = "Manual"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + network_profile {
          + ip_forwarding = false
          + name          = "privateNetworkProfile"
          + primary       = true

          + ip_configuration {
              + application_gateway_backend_address_pool_ids = []
              + application_security_group_ids               = []
              + load_balancer_backend_address_pool_ids       = (known after apply)
              + load_balancer_inbound_nat_rules_ids          = (known after apply)
              + name                                         = "PrivateIPConfiguration"
              + primary                                      = true
              + subnet_id                                    = (known after apply)
            }
        }

      + os_profile {
          + admin_password       = (sensitive value)
          + admin_username       = "testadmin"
          + computer_name_prefix = "team1"
        }

      + os_profile_linux_config {
          + disable_password_authentication = false

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDDOphCHThzsgraK4np2AtNZiQeru2l1gNMyqeSg9K/elaW7kWGqtcsRR3vP1zQDZbWfhhfyqARn9DEZLQFhsAt59CCc1sokmFnWUaHcANS4+3B0fbIFuBJ/i7SgKjkFRXpFoQ7NFzp9uzJ4QQ/R1+qSO80VSPYLz7sciypLphTNXScd3L/gqEBN72Rmbf5Xq5pa1HU4AzEnYd8lc/y9TlCeSs62LoXz+FzRPd8+CzIKtY/T6FAS1fh/E+haVkb8ghkBQ4NIbh7WXCgIUPu/PeM/XTQZ+N6WWI0kuSWdszYzIcVEuflWAwxg8+YXwHn0zX45uF+jRTQX2uy49DH4epeFYbHPQ8ESF/wUdd+M7ZBJQKd/FcVw/otxhK0e7B81TDgVx/Up0I+mgRCHQ45tTcHQ1aSZuLjLov5A6D7EIKdChGSxuWZI6CgQYZt39scOnZbNU0i2Qu2oNOQ8vSCABJ3jTFJUfaF0RN3eICRnwuBogXrpeBYxQm2nP1E9zkjyeSN6uaDPPNJAhztOvz2eHbMRAZjmNvy3EHs2LIntcy3hTgzBM0AzDrtnEwAPkVngPhpB1kX6kJlFZ/Qs+9X9lhQbH32rMB7NOUlJirIvoBTgA/R4LzPR5djI1+S7b1YPLBtqOhgmG9lZcbM4OwjV1mRPRtUuxYS5sWX2RESU156XQ== Generated by E217974@PC38695."
              + path     = "/home/testadmin/.ssh/authorized_keys"
            }
        }

      + sku {
          + capacity = 3
          + name     = "Standard_B1ms"
          + tier     = "Standard"
        }

      + storage_profile_data_disk {
          + caching           = "ReadWrite"
          + create_option     = "Empty"
          + disk_size_gb      = 10
          + lun               = 0
          + managed_disk_type = (known after apply)
        }

      + storage_profile_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_profile_os_disk {
          + caching           = "ReadWrite"
          + create_option     = "FromImage"
          + managed_disk_type = "Standard_LRS"
          + vhd_containers    = []
        }
    }

  # azurerm_virtual_machine_scale_set.vmss will be created
  + resource "azurerm_virtual_machine_scale_set" "vmss" {
      + automatic_os_upgrade   = false
      + id                     = (known after apply)
      + license_type           = (known after apply)
      + location               = "northeurope"
      + name                   = "vmscaleset"
      + overprovision          = true
      + resource_group_name    = "devops-training-team1"
      + single_placement_group = true
      + tags                   = (known after apply)
      + upgrade_policy_mode    = "Manual"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + network_profile {
          + ip_forwarding = false
          + name          = "publicNetworkProfile"
          + primary       = true

          + ip_configuration {
              + application_gateway_backend_address_pool_ids = []
              + application_security_group_ids               = []
              + load_balancer_backend_address_pool_ids       = (known after apply)
              + load_balancer_inbound_nat_rules_ids          = (known after apply)
              + name                                         = "PublicIPConfiguration"
              + primary                                      = true
              + subnet_id                                    = (known after apply)
            }
        }

      + os_profile {
          + admin_password       = (sensitive value)
          + admin_username       = "testadmin"
          + computer_name_prefix = "team1"
        }

      + os_profile_linux_config {
          + disable_password_authentication = false

          + ssh_keys {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDDOphCHThzsgraK4np2AtNZiQeru2l1gNMyqeSg9K/elaW7kWGqtcsRR3vP1zQDZbWfhhfyqARn9DEZLQFhsAt59CCc1sokmFnWUaHcANS4+3B0fbIFuBJ/i7SgKjkFRXpFoQ7NFzp9uzJ4QQ/R1+qSO80VSPYLz7sciypLphTNXScd3L/gqEBN72Rmbf5Xq5pa1HU4AzEnYd8lc/y9TlCeSs62LoXz+FzRPd8+CzIKtY/T6FAS1fh/E+haVkb8ghkBQ4NIbh7WXCgIUPu/PeM/XTQZ+N6WWI0kuSWdszYzIcVEuflWAwxg8+YXwHn0zX45uF+jRTQX2uy49DH4epeFYbHPQ8ESF/wUdd+M7ZBJQKd/FcVw/otxhK0e7B81TDgVx/Up0I+mgRCHQ45tTcHQ1aSZuLjLov5A6D7EIKdChGSxuWZI6CgQYZt39scOnZbNU0i2Qu2oNOQ8vSCABJ3jTFJUfaF0RN3eICRnwuBogXrpeBYxQm2nP1E9zkjyeSN6uaDPPNJAhztOvz2eHbMRAZjmNvy3EHs2LIntcy3hTgzBM0AzDrtnEwAPkVngPhpB1kX6kJlFZ/Qs+9X9lhQbH32rMB7NOUlJirIvoBTgA/R4LzPR5djI1+S7b1YPLBtqOhgmG9lZcbM4OwjV1mRPRtUuxYS5sWX2RESU156XQ== Generated by E217974@PC38695."
              + path     = "/home/testadmin/.ssh/authorized_keys"
            }
        }

      + sku {
          + capacity = 3
          + name     = "Standard_B1ms"
          + tier     = "Standard"
        }

      + storage_profile_data_disk {
          + caching           = "ReadWrite"
          + create_option     = "Empty"
          + disk_size_gb      = 10
          + lun               = 0
          + managed_disk_type = (known after apply)
        }

      + storage_profile_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_profile_os_disk {
          + caching           = "ReadWrite"
          + create_option     = "FromImage"
          + managed_disk_type = "Standard_LRS"
          + vhd_containers    = []
        }
    }

  # azurerm_virtual_network.main will be destroyed
  - resource "azurerm_virtual_network" "main" {
      - address_space       = [
          - "10.0.0.0/16",
        ] -> null
      - dns_servers         = [] -> null
      - id                  = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-network" -> null
      - location            = "northeurope" -> null
      - name                = "team1-network" -> null
      - resource_group_name = "devops-training-team1" -> null
      - tags                = {} -> null

      - subnet {
          - address_prefix = "10.0.1.0/24" -> null
          - id             = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-network/subnets/team1-internal" -> null
          - name           = "team1-internal" -> null
        }
    }

  # module.vm1.azurerm_network_interface.main will be destroyed
  - resource "azurerm_network_interface" "main" {
      - applied_dns_servers           = [] -> null
      - dns_servers                   = [] -> null
      - enable_accelerated_networking = false -> null
      - enable_ip_forwarding          = false -> null
      - id                            = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team11-vm-nic" -> null
      - location                      = "northeurope" -> null
      - mac_address                   = "00-0D-3A-D7-FB-5C" -> null
      - name                          = "team11-vm-nic" -> null
      - private_ip_address            = "10.0.1.5" -> null
      - private_ip_addresses          = [
          - "10.0.1.5",
        ] -> null
      - resource_group_name           = "devops-training-team1" -> null
      - tags                          = {} -> null
      - virtual_machine_id            = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team11-vm" -> null

      - ip_configuration {
          - application_gateway_backend_address_pools_ids = [] -> null
          - application_security_group_ids                = [] -> null
          - load_balancer_backend_address_pools_ids       = [] -> null
          - load_balancer_inbound_nat_rules_ids           = [] -> null
          - name                                          = "testconfiguration1" -> null
          - primary                                       = true -> null
          - private_ip_address                            = "10.0.1.5" -> null
          - private_ip_address_allocation                 = "dynamic" -> null
          - private_ip_address_version                    = "IPv4" -> null
          - public_ip_address_id                          = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/publicIPAddresses/team11-vm-pip" -> null
          - subnet_id                                     = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-network/subnets/team1-internal" -> null
        }
    }

  # module.vm1.azurerm_public_ip.main will be destroyed
  - resource "azurerm_public_ip" "main" {
      - allocation_method            = "Static" -> null
      - id                           = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/publicIPAddresses/team11-vm-pip" -> null
      - idle_timeout_in_minutes      = 4 -> null
      - ip_address                   = "52.169.152.212" -> null
      - ip_version                   = "IPv4" -> null
      - location                     = "northeurope" -> null
      - name                         = "team11-vm-pip" -> null
      - public_ip_address_allocation = "Static" -> null
      - resource_group_name          = "devops-training-team1" -> null
      - sku                          = "Basic" -> null
      - tags                         = {} -> null
      - zones                        = [] -> null
    }

  # module.vm1.azurerm_virtual_machine.main will be destroyed
  - resource "azurerm_virtual_machine" "main" {
      - delete_data_disks_on_termination = false -> null
      - delete_os_disk_on_termination    = false -> null
      - id                               = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team11-vm" -> null
      - location                         = "northeurope" -> null
      - name                             = "team11-vm" -> null
      - network_interface_ids            = [
          - "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team11-vm-nic",
        ] -> null
      - resource_group_name              = "devops-training-team1" -> null
      - tags                             = {} -> null
      - vm_size                          = "Standard_B1ms" -> null
      - zones                            = [] -> null

      - os_profile {
          - admin_username = "testadmin" -> null
          - computer_name  = "hostname" -> null
        }

      - os_profile_linux_config {
          - disable_password_authentication = false -> null
        }

      - storage_image_reference {
          - offer     = "UbuntuServer" -> null
          - publisher = "Canonical" -> null
          - sku       = "18.04-LTS" -> null
          - version   = "latest" -> null
        }

      - storage_os_disk {
          - caching                   = "ReadWrite" -> null
          - create_option             = "FromImage" -> null
          - disk_size_gb              = 30 -> null
          - managed_disk_id           = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/disks/team11-vmosdisk" -> null
          - managed_disk_type         = "Standard_LRS" -> null
          - name                      = "team11-vmosdisk" -> null
          - os_type                   = "Linux" -> null
          - write_accelerator_enabled = false -> null
        }
    }

  # module.vm1.azurerm_virtual_machine_extension.main[0] will be destroyed
  - resource "azurerm_virtual_machine_extension" "main" {
      - auto_upgrade_minor_version = false -> null
      - id                         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team11-vm/extensions/nginx" -> null
      - location                   = "northeurope" -> null
      - name                       = "nginx" -> null
      - protected_settings         = (sensitive value)
      - publisher                  = "Microsoft.Azure.Extensions" -> null
      - resource_group_name        = "devops-training-team1" -> null
      - tags                       = {} -> null
      - type                       = "CustomScript" -> null
      - type_handler_version       = "2.0" -> null
      - virtual_machine_id         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team11-vm" -> null
      - virtual_machine_name       = "team11-vm" -> null
    }

  # module.vm2.azurerm_network_interface.main will be destroyed
  - resource "azurerm_network_interface" "main" {
      - applied_dns_servers           = [] -> null
      - dns_servers                   = [] -> null
      - enable_accelerated_networking = false -> null
      - enable_ip_forwarding          = false -> null
      - id                            = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team12-vm-nic" -> null
      - location                      = "northeurope" -> null
      - mac_address                   = "00-0D-3A-D7-F6-83" -> null
      - name                          = "team12-vm-nic" -> null
      - private_ip_address            = "10.0.1.6" -> null
      - private_ip_addresses          = [
          - "10.0.1.6",
        ] -> null
      - resource_group_name           = "devops-training-team1" -> null
      - tags                          = {} -> null
      - virtual_machine_id            = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team12-vm" -> null

      - ip_configuration {
          - application_gateway_backend_address_pools_ids = [] -> null
          - application_security_group_ids                = [] -> null
          - load_balancer_backend_address_pools_ids       = [] -> null
          - load_balancer_inbound_nat_rules_ids           = [] -> null
          - name                                          = "testconfiguration1" -> null
          - primary                                       = true -> null
          - private_ip_address                            = "10.0.1.6" -> null
          - private_ip_address_allocation                 = "dynamic" -> null
          - private_ip_address_version                    = "IPv4" -> null
          - public_ip_address_id                          = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/publicIPAddresses/team12-vm-pip" -> null
          - subnet_id                                     = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-network/subnets/team1-internal" -> null
        }
    }

  # module.vm2.azurerm_public_ip.main will be destroyed
  - resource "azurerm_public_ip" "main" {
      - allocation_method            = "Static" -> null
      - id                           = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/publicIPAddresses/team12-vm-pip" -> null
      - idle_timeout_in_minutes      = 4 -> null
      - ip_address                   = "52.169.156.213" -> null
      - ip_version                   = "IPv4" -> null
      - location                     = "northeurope" -> null
      - name                         = "team12-vm-pip" -> null
      - public_ip_address_allocation = "Static" -> null
      - resource_group_name          = "devops-training-team1" -> null
      - sku                          = "Basic" -> null
      - tags                         = {} -> null
      - zones                        = [] -> null
    }

  # module.vm2.azurerm_virtual_machine.main will be destroyed
  - resource "azurerm_virtual_machine" "main" {
      - delete_data_disks_on_termination = false -> null
      - delete_os_disk_on_termination    = false -> null
      - id                               = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team12-vm" -> null
      - location                         = "northeurope" -> null
      - name                             = "team12-vm" -> null
      - network_interface_ids            = [
          - "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team12-vm-nic",
        ] -> null
      - resource_group_name              = "devops-training-team1" -> null
      - tags                             = {} -> null
      - vm_size                          = "Standard_B1ms" -> null
      - zones                            = [] -> null

      - os_profile {
          - admin_username = "testadmin" -> null
          - computer_name  = "hostname" -> null
        }

      - os_profile_linux_config {
          - disable_password_authentication = false -> null
        }

      - storage_image_reference {
          - offer     = "UbuntuServer" -> null
          - publisher = "Canonical" -> null
          - sku       = "18.04-LTS" -> null
          - version   = "latest" -> null
        }

      - storage_os_disk {
          - caching                   = "ReadWrite" -> null
          - create_option             = "FromImage" -> null
          - disk_size_gb              = 30 -> null
          - managed_disk_id           = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/disks/team12-vmosdisk" -> null
          - managed_disk_type         = "Standard_LRS" -> null
          - name                      = "team12-vmosdisk" -> null
          - os_type                   = "Linux" -> null
          - write_accelerator_enabled = false -> null
        }
    }

  # module.vm2.azurerm_virtual_machine_extension.main[0] will be destroyed
  - resource "azurerm_virtual_machine_extension" "main" {
      - auto_upgrade_minor_version = false -> null
      - id                         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team12-vm/extensions/nginx" -> null
      - location                   = "northeurope" -> null
      - name                       = "nginx" -> null
      - protected_settings         = (sensitive value)
      - publisher                  = "Microsoft.Azure.Extensions" -> null
      - resource_group_name        = "devops-training-team1" -> null
      - tags                       = {} -> null
      - type                       = "CustomScript" -> null
      - type_handler_version       = "2.0" -> null
      - virtual_machine_id         = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team12-vm" -> null
      - virtual_machine_name       = "team12-vm" -> null
    }

  # module.vm3.azurerm_network_interface.main will be destroyed
  - resource "azurerm_network_interface" "main" {
      - applied_dns_servers           = [] -> null
      - dns_servers                   = [] -> null
      - enable_accelerated_networking = false -> null
      - enable_ip_forwarding          = false -> null
      - id                            = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team13-vm-nic" -> null
      - location                      = "northeurope" -> null
      - mac_address                   = "00-0D-3A-B2-58-C1" -> null
      - name                          = "team13-vm-nic" -> null
      - private_ip_address            = "10.0.1.4" -> null
      - private_ip_addresses          = [
          - "10.0.1.4",
        ] -> null
      - resource_group_name           = "devops-training-team1" -> null
      - tags                          = {} -> null
      - virtual_machine_id            = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team13-vm" -> null

      - ip_configuration {
          - application_gateway_backend_address_pools_ids = [] -> null
          - application_security_group_ids                = [] -> null
          - load_balancer_backend_address_pools_ids       = [] -> null
          - load_balancer_inbound_nat_rules_ids           = [] -> null
          - name                                          = "testconfiguration1" -> null
          - primary                                       = true -> null
          - private_ip_address                            = "10.0.1.4" -> null
          - private_ip_address_allocation                 = "dynamic" -> null
          - private_ip_address_version                    = "IPv4" -> null
          - public_ip_address_id                          = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/publicIPAddresses/team13-vm-pip" -> null
          - subnet_id                                     = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-network/subnets/team1-internal" -> null
        }
    }

  # module.vm3.azurerm_public_ip.main will be destroyed
  - resource "azurerm_public_ip" "main" {
      - allocation_method            = "Static" -> null
      - id                           = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/publicIPAddresses/team13-vm-pip" -> null
      - idle_timeout_in_minutes      = 4 -> null
      - ip_address                   = "52.169.156.208" -> null
      - ip_version                   = "IPv4" -> null
      - location                     = "northeurope" -> null
      - name                         = "team13-vm-pip" -> null
      - public_ip_address_allocation = "Static" -> null
      - resource_group_name          = "devops-training-team1" -> null
      - sku                          = "Basic" -> null
      - tags                         = {} -> null
      - zones                        = [] -> null
    }

  # module.vm3.azurerm_virtual_machine.main will be destroyed
  - resource "azurerm_virtual_machine" "main" {
      - delete_data_disks_on_termination = false -> null
      - delete_os_disk_on_termination    = false -> null
      - id                               = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachines/team13-vm" -> null
      - location                         = "northeurope" -> null
      - name                             = "team13-vm" -> null
      - network_interface_ids            = [
          - "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkInterfaces/team13-vm-nic",
        ] -> null
      - resource_group_name              = "devops-training-team1" -> null
      - tags                             = {} -> null
      - vm_size                          = "Standard_B1ms" -> null
      - zones                            = [] -> null

      - os_profile {
          - admin_username = "testadmin" -> null
          - computer_name  = "hostname" -> null
        }

      - os_profile_linux_config {
          - disable_password_authentication = false -> null
        }

      - storage_image_reference {
          - offer     = "UbuntuServer" -> null
          - publisher = "Canonical" -> null
          - sku       = "18.04-LTS" -> null
          - version   = "latest" -> null
        }

      - storage_os_disk {
          - caching                   = "ReadWrite" -> null
          - create_option             = "FromImage" -> null
          - disk_size_gb              = 30 -> null
          - managed_disk_id           = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/disks/team13-vmosdisk" -> null
          - managed_disk_type         = "Standard_LRS" -> null
          - name                      = "team13-vmosdisk" -> null
          - os_type                   = "Linux" -> null
          - write_accelerator_enabled = false -> null
        }
    }

  # module.vnet.azurerm_resource_group.vnet will be created
  + resource "azurerm_resource_group" "vnet" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "devops-training-team1"
      + tags     = (known after apply)
    }

  # module.vnet.azurerm_subnet.subnet[0] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = "10.0.1.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "frontend"
      + resource_group_name                            = "devops-training-team1"
      + virtual_network_name                           = "acctvnet"
    }

  # module.vnet.azurerm_subnet.subnet[1] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = "10.0.2.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "backend"
      + resource_group_name                            = "devops-training-team1"
      + virtual_network_name                           = "acctvnet"
    }

  # module.vnet.azurerm_subnet.subnet[2] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = "10.0.3.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "database"
      + resource_group_name                            = "devops-training-team1"
      + virtual_network_name                           = "acctvnet"
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = []
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "acctvnet"
      + resource_group_name = "devops-training-team1"
      + tags                = {
          + "tag1" = ""
          + "tag2" = ""
        }

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

Plan: 25 to add, 0 to change, 18 to destroy.

Warning: "network_security_group_id": [DEPRECATED] Use the `azurerm_subnet_network_security_group_association` resource instead.

  on main.tf line 14, in resource "azurerm_subnet" "frontend":
  14: resource "azurerm_subnet" "frontend" {

(and 3 more similar warnings elsewhere)


Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vnet/Azure-terraform-azurerm-vnet-e0b9155/main.tf line 3, in resource "azurerm_resource_group" "vnet":
   3:   name     = "${var.resource_group_name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 12 more similar warnings elsewhere)


Warning: Quoted type constraints are deprecated

  on .terraform/modules/vnet/Azure-terraform-azurerm-vnet-e0b9155/variables.tf line 39, in variable "nsg_ids":
  39:   type        = "map"

Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "map" and write
map(string) instead to explicitly indicate that the map elements are strings.

(and one more similar warning elsewhere)

```

</details>

*Workflow: `Terraform validation`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./Oppgave1`*
